title: Rundll32 With Suspicious Parent Process
description: Detects suspicious start of rundll32.exe with a parent process of Explorer.exe. Variant of Raspberry Robin.
status: experimental
references:
    - https://redcanary.com/blog/raspberry-robin/
author: Florian Roth
date: 2021/05/27
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
		ParentImage|endswith: '\explorer.exe'
    condition: selection
fields:
    - Image
    - ParentImage
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion 